#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

azuread_application.example: Refreshing state... [id=/applications/1d9507e2-cb49-4bf8-ab3a-18dc65565355]
module.azure_bot.azuread_application.application: Refreshing state... [id=/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azuread_application.example will be destroyed
  # (because azuread_application.example is not in configuration)
  - resource "azuread_application" "example" {
      - app_role_ids                   = {} -> null
      - application_id                 = "00f33ab7-f0f7-4248-bdac-ea48b1ce54fa" -> null
      - client_id                      = "00f33ab7-f0f7-4248-bdac-ea48b1ce54fa" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "Terraform" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "/applications/1d9507e2-cb49-4bf8-ab3a-18dc65565355" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "1d9507e2-cb49-4bf8-ab3a-18dc65565355" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "exkouichi1224gmail.onmicrosoft.com" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "e1fe6dd8-ba31-4d61-89e7-88639da4683d" -> null
              - type = "Scope" -> null
            }
          - resource_access {
              - id   = "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9" -> null
              - type = "Role" -> null
            }
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # module.azure_bot.azuread_application_password.example will be created
  + resource "azuread_application_password" "example" {
      + application_id        = "/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc"
      + application_object_id = (known after apply)
      + display_name          = "koichi-furukawa-example-1-dev-client-secret"
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.azure_bot.time_rotating.example will be created
  + resource "time_rotating" "example" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kooooichi24, Action: `pull_request`, Working Directory: `./dev`, Workflow: `Terraform Plan`*